#include<iostream>
#include"GUI.h"
#include<iomanip>
#include"key.h"
using namespace std;
void History(int col);
void Center(int col);

void main()
{
	
	//while (1) 
	{
		GUI();
		key();
		//system("cls");
		
	}
	
	system("Pause");
}

void History(int col)
{
	
	if (col == 0)
	{
		cout << "\u2588";
		cout << setw(10) << "\u6230\u722d\u9032\u5ea6";
		cout << setw(10) << "\u2588";
	}
	else
	{
		cout << "\u2588" << setw(18) << "" << "\u2588";
	}
}
void Center(int col)
{
	string a[35] = { "\u2554","\u2550","\u2550","\u2550","\u2550","\u2550","\u2550","\u2550","\u2550","\u2550","\u2550","\u2550","\u2550","\u2550","\u2550","\u2550","\u2550","\u2550","\u2550","\u2557" };
	string f[20] = { 
		"ùÝùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùß",
		"ùø  ùø  ùø  ùø  ùø  ùø  ùø  ùø  ùø",
		"ùà¢w¢wùá¢w¢wùá¢w¢wùá¢w¢wùá¢w¢wùá¢w¢wùá¢w¢wùá¢w¢wùâ",
		"ùø  ùø  ùø  ùø¡þùø¢@ùø  ùø  ùø  ùø",
		"ùà¢w¢wùá¢w¢wùá¢w¢wùá¢w¢wùá¢w¢wùá¢w¢wùá¢w¢wùá¢w¢wùâ",
		"ùø  ùø  ùø  ùø  ùø  ùø  ùø  ùø  ùø",
		"ùà¢w¢wùá¢w¢wùá¢w¢wùá¢w¢wùá¢w¢wùá¢w¢wùá¢w¢wùá¢w¢wùâ",
		"ùø  ùø  ùø  ùø  ùø  ùø  ùø  ùø  ùø",
		"ùàùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùâ",
		"ùø       \u695a\u6cb3\u6f22\u754c        ùø",
		"ùàùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùâ",
		"ùø  ùø  ùø  ùø  ùø  ùø  ùø  ùø  ùø",
		"ùà¢w¢wùá¢w¢wùá¢w¢wùá¢w¢wùá¢w¢wùá¢w¢wùá¢w¢wùá¢w¢wùâ",
		"ùø  ùø  ùø  ùø  ùø  ùø  ùø  ùø  ùø",
		"ùà¢w¢wùá¢w¢wùá¢w¢wùá¢w¢wùá¢w¢wùá¢w¢wùá¢w¢wùá¢w¢wùâ",
		"ùø  ùø  ùø  ùø  ùø  ùø  ùø  ùø  ùø",
		"ùà¢w¢wùá¢w¢wùá¢w¢wùá¢w¢wùá¢w¢wùá¢w¢wùá¢w¢wùá¢w¢wùâ",
		"ùø  ùø  ùø  ùø  ùø  ùø  ùø  ùø  ùø",
		"ùãùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùå" };
	for(int i=0;i<20;i++)
	cout << f[i]<<endl;
	cout<<endl;
	
}